Most recent local testing result returns:

```
# module.example.module.monitor_autoscale_settings["mas1"].azurerm_monitor_autoscale_setting.this will be created
  + resource "azurerm_monitor_autoscale_setting" "this" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = "mas1"
      + resource_group_name = (known after apply)
      + target_resource_id  = (known after apply)

      + notification {
          + email {
              + custom_emails                         = [
                  + "admin@contoso.com",
                ]
              + send_to_subscription_administrator    = true
              + send_to_subscription_co_administrator = true
            }
        }

      + profile {
          + name = "profile1"

          + capacity {
              + default = 1
              + maximum = 3
              + minimum = 1
            }

          + recurrence {
              + days     = [
                  + "Saturday",
                  + "Sunday",
                ]
              + hours    = [
                  + 12,
                ]
              + minutes  = [
                  + 0,
                ]
              + timezone = "Pacific Standard Time"
            }

          + rule {
              + metric_trigger {
                  + metric_name        = "Percentage CPU"
                  + metric_resource_id = (known after apply)
                  + operator           = "GreaterThan"
                  + statistic          = "Average"
                  + threshold          = 90
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }

              + scale_action {
                  + cooldown  = "PT1M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
        }
    }
```

Still need to finish dimensions and a few examples.